Revit 2027 API
Hub.HasOrigin Method
 Provides information if Hub has a specific location at point in 3D space.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasOrigin()
Public Function HasOrigin As Boolean
public:
bool HasOrigin()
member HasOrigin : unit -> bool
Return Value
Boolean
 True if the Hub has a specific location at point in 3D space.
See Also
Reference
Hub Class
Autodesk.Revit.DB.Structure Namespace